# Pandas - DataFrame

In [19]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
### 1. DataFrame  생성 
kor = [80, 90, 70, 30]              # list
eng = np.array([90, 70, 60, 40])    # array
math = (90, 60, 80, 70)             # tuple

In [7]:
df = pd.DataFrame({
    '국어' : kor,'영어' : eng, "수학" : math
}, index = ['춘향','몽룡','향단','방자'])
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [55]:
np.random.seed(2021)
df2 = pd.DataFrame(np.random.randint(40,101,12).reshape(4,3),
                   columns=['국어', '영어', '수학'], index=['춘향', '몽룡', '향단','방자'])
df2

    국어  영어  수학
춘향  92  61  97
몽룡  40  85  70
향단  62  84  67
방자  69  61  69

### 2. 인덱싱

In [12]:
df['국어']['춘향'], df.국어['춘향'], df.국어[0], df['국어'][0], df.국어, 춘향

NameError: name '춘향' is not defined

In [13]:
df.국어

춘향    80
몽룡    90
향단    70
방자    30
Name: 국어, dtype: int64

- 연습문제 4.1.3

In [14]:
# 1.  모든 학생의 수학 점수를 시리즈로 나타낸다.

In [15]:
# 2. 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

In [16]:
# 3. 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df['평균'] = df.mean(axis=1)
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [20]:
# 4. 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df.영어.방자 = 80
df.평균 = df.mean (axis=1)
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  59.791667

In [21]:
# 5.  춘향의 점수를 데이터프레임으로 나타낸다.
df[0:1]

    국어  영어  수학         평균
춘향  80  90  90  86.666667

In [22]:
df[['국어', '영어', '수학']][:1]

    국어  영어  수학
춘향  80  90  90

In [23]:
df.iloc[:1, :-1]

    국어  영어  수학
춘향  80  90  90

In [25]:
# 평균 열 삭제

del df['평균']
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  80  70

In [49]:
# 영어, 수학 점수 없애기 (df2에서)

df2

    국어
춘향  92
몽룡  40
향단  62

In [50]:
df3 = df2[['국어']]
df3

#df3에 국어만 가져옴으로 수학, 영어를 없앤 효과를 나타낸다.

    국어
춘향  92
몽룡  40
향단  62

In [56]:
# 조금 세련된 방법ㅋㅎ

df2.drop(columns=['영어','수학'])

    국어
춘향  92
몽룡  40
향단  62
방자  69

In [57]:
df2 #근데 안 먹힘

    국어  영어  수학
춘향  92  61  97
몽룡  40  85  70
향단  62  84  67
방자  69  61  69

In [58]:
# 그냥 저 위에 프레임 하나에만 그렇게 적용된거고 
# 자기 자신을 변화시키려면 inplace=True 옵션을 주어야함

df2.drop(columns=['영어','수학'], inplace=True)
df2

    국어
춘향  92
몽룡  40
향단  62
방자  69

In [60]:
# 행 삭제
df2.drop('방자')

    국어
춘향  92
몽룡  40
향단  62

In [62]:
df2.drop(index=['방자'], inplace=True)
df2

KeyError: "['방자'] not found in axis"

In [63]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  80  70

In [65]:
# 춘향, 몽룡의 영어, 수학 점수
# slicing 할 때는 인덱싱 다 써주기 
df.loc['춘향':'몽룡', '영어':]

    영어  수학
춘향  90  90
몽룡  70  60

In [64]:
# 몽룡, 향단의 국어, 수학 점수
df.iloc[1:3, ::2]

    국어  수학
몽룡  90  60
향단  70  80

In [66]:
# 몽룡, 향단의 영어, 수학 점수
df.loc ['몽룡':'향단',"영어":]

    영어  수학
몽룡  70  60
향단  60  80

In [67]:
# 몽룡, 향단의
# 이거 놓침ㅋ


df.iloc[3:4,::-1]

    수학  영어  국어
방자  70  80  30